
. 
. display "{hline 80}"
--------------------------------------------------------------------------------

. display "WFH IMPUTATION - THREE-PART MODEL IMPLEMENTATION"
WFH IMPUTATION - THREE-PART MODEL IMPLEMENTATION

. display "{hline 80}"
--------------------------------------------------------------------------------

. 
. /*
> ==============================================================================
> PHASE A: ESTIMATION ON TRAINING DATA (SWAA)
> ==============================================================================
> */
. 
. display ""


. display "PHASE A: ESTIMATION ON TRAINING DATA (SWAA)"
PHASE A: ESTIMATION ON TRAINING DATA (SWAA)

. display "{hline 50}"
--------------------------------------------------

. 
. // Import the prepared SWAA training data
. display "Loading SWAA training data..."
Loading SWAA training data...

. import delimited "data/processed/swaa_prepared_for_stata.csv", clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 66,888 obs)

. 
. // Display basic statistics of the training data
. display ""


. display "Training data summary:"
Training data summary:

. describe

Contains data
 Observations:        66,888                  
    Variables:            10                  
------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
wfh_share       float   %9.0g                 
cratio100       float   %9.0g                 
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 
year            int     %8.0g                 
------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. summarize wfh_share, detail

                          wfh_share
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              66,888
25%            0              0       Sum of wgt.      66,888

50%            0                      Mean           .3100738
                        Largest       Std. dev.      .3903778
75%           .6              1
90%            1              1       Variance       .1523948
95%            1              1       Skewness       .8358724
99%            1              1       Kurtosis       2.087208

. 
. display ""


. display "Original WFH share distribution in SWAA data:"
Original WFH share distribution in SWAA data:

. count if wfh_share == 0
  34,848

. display "Fully in-person (wfh_share = 0): " r(N) " (" %4.1f r(N)/_N*100 "%)"
Fully in-person (wfh_share = 0): 34848 (52.1%)

. 
. count if wfh_share == 1
  12,191

. display "Fully remote (wfh_share = 1): " r(N) " (" %4.1f r(N)/_N*100 "%)"
Fully remote (wfh_share = 1): 12191 (18.2%)

. 
. count if wfh_share > 0 & wfh_share < 1
  19,849

. display "Hybrid (0 < wfh_share < 1): " r(N) " (" %4.1f r(N)/_N*100 "%)"
Hybrid (0 < wfh_share < 1): 19849 (29.7%)

. 
. /*
> ==============================================================================
> STEP 1: CREATE DEPENDENT VARIABLES FOR THREE-PART MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 1: Creating dependent variables for three-part model..."
STEP 1: Creating dependent variables for three-part model...

. 
. // 1. Create the "hurdle" variable: Is the person NOT fully in-person?
. gen is_remote_any = (wfh_share > 0)

. label variable is_remote_any "Binary: Any remote work (wfh_share > 0)"

. 
. // 2. Create the "top corner" variable: Is the person fully remote, given they are not fully in-person?
. gen is_full_remote = (wfh_share == 1) if wfh_share > 0
(34,848 missing values generated)

. label variable is_full_remote "Binary: Fully remote, conditional on any remote work"

. 
. // 3. The original wfh_share will be used for the interior model (already exists)
. 
. // Display the new variables
. display ""


. display "New dependent variables created:"
New dependent variables created:

. tabulate is_remote_any, missing

Binary: Any |
remote work |
 (wfh_share |
       > 0) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,848       52.10       52.10
          1 |     32,040       47.90      100.00
------------+-----------------------------------
      Total |     66,888      100.00

. tabulate is_full_remote if wfh_share > 0, missing

    Binary: |
      Fully |
    remote, |
conditional |
     on any |
remote work |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,849       61.95       61.95
          1 |     12,191       38.05      100.00
------------+-----------------------------------
      Total |     32,040      100.00

. 
. /*
> ==============================================================================
> STEP 2: ESTIMATE MODEL 1 - THE "HURDLE" MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 2: Estimating Model 1 - Hurdle Model P(wfh_share > 0)"
STEP 2: Estimating Model 1 - Hurdle Model P(wfh_share > 0)

. display "{hline 60}"
------------------------------------------------------------

. 
. // Model 1: Logit for P(wfh_share > 0)
. // This is estimated on the FULL sample
. logit is_remote_any ///
>     i.occupation_clean ///
>     i.work_industry ///
>     i.education_s ///
>     i.agebin ///
>     i.gender ///
>     i.race_ethnicity_s ///
>     i.censusdivision ///
>     [pweight=cratio100]

Iteration 0:  Log pseudolikelihood = -9.9748827  
Iteration 1:  Log pseudolikelihood = -8.9196346  
Iteration 2:  Log pseudolikelihood = -8.9152603  
Iteration 3:  Log pseudolikelihood = -8.9152593  
Iteration 4:  Log pseudolikelihood = -8.9152593  

Logistic regression                                    Number of obs =  66,888
                                                       Wald chi2(47) = 4662.72
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -8.9152593                      Pseudo R2     =  0.1062

----------------------------------------------------------------------------------
                 |               Robust
   is_remote_any | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
occupation_clean |
              2  |  -.4243041    .148416    -2.86   0.004     -.715194   -.1334141
              3  |   .4407349   .1850958     2.38   0.017     .0779538     .803516
              4  |  -.4339818   .1450499    -2.99   0.003    -.7182743   -.1496893
              5  |   .2094698   .1328073     1.58   0.115    -.0508277    .4697672
              6  |  -.0828112   .1331371    -0.62   0.534    -.3437551    .1781328
              7  |  -.5511181   .1393245    -3.96   0.000    -.8241891   -.2780472
              8  |  -.2999544     .13189    -2.27   0.023     -.558454   -.0414547
              9  |   .0248122   .1366016     0.18   0.856     -.242922    .2925463
             10  |  -.4486205   .1333648    -3.36   0.001    -.7100107   -.1872303
             11  |  -.5611201   .1479852    -3.79   0.000    -.8511657   -.2710745
             12  |  -.3357061   .1969368    -1.70   0.088    -.7216951     .050283
                 |
   work_industry |
              2  |   .7888984   .1436199     5.49   0.000     .5074087    1.070388
              3  |   .9216965   .1282421     7.19   0.000     .6703466    1.173046
              4  |   .0646497   .1310852     0.49   0.622    -.1922726    .3215721
              5  |  -.4955017   .1277337    -3.88   0.000    -.7458551   -.2451484
              6  |  -.1077132   .1252111    -0.86   0.390    -.3531225    .1376962
              7  |  -.7805849   .1313403    -5.94   0.000    -1.038007   -.5231626
              8  |   1.110782   .1332346     8.34   0.000     .8496473    1.371917
              9  |  -.2392378   .1269994    -1.88   0.060    -.4881521    .0096766
             10  |   .2735728   .2236788     1.22   0.221    -.1648296    .7119752
             11  |   .6897314   .1249872     5.52   0.000     .4447611    .9347018
             12  |   .5674496      .1454     3.90   0.000     .2824709    .8524283
             13  |  -.5879749   .1283387    -4.58   0.000     -.839514   -.3364357
             14  |  -.4733836   .1369022    -3.46   0.001    -.7417069   -.2050603
             15  |   .3997068   .1567559     2.55   0.011     .0924709    .7069427
             16  |   .5132954   .1533112     3.35   0.001     .2128109    .8137799
             17  |  -.1595256   .1294172    -1.23   0.218    -.4131786    .0941274
             18  |  -.0391712   .1866344    -0.21   0.834    -.4049678    .3266254
                 |
     education_s |
              2  |   .0968898   .1273085     0.76   0.447    -.1526302    .3464099
              3  |   .2406228   .1267496     1.90   0.058    -.0078018    .4890474
              4  |   .7133586   .1268926     5.62   0.000     .4646536    .9620636
              5  |   1.012356   .1286678     7.87   0.000     .7601716     1.26454
                 |
          agebin |
              3  |   .0801577   .0404484     1.98   0.048     .0008803     .159435
              4  |  -.0174546   .0398083    -0.44   0.661    -.0954775    .0605683
              5  |  -.1928781    .039033    -4.94   0.000    -.2693814   -.1163747
                 |
        2.gender |   .0027881   .0252651     0.11   0.912    -.0467306    .0523067
                 |
race_ethnicity_s |
              2  |  -.2482794   .0471369    -5.27   0.000     -.340666   -.1558928
              3  |  -.1959625   .0498266    -3.93   0.000    -.2936208   -.0983042
              4  |  -.3340313   .0347269    -9.62   0.000    -.4020947   -.2659679
                 |
  censusdivision |
              2  |   .1278255   .0646563     1.98   0.048     .0011015    .2545495
              3  |   .0137131   .0645127     0.21   0.832    -.1127294    .1401557
              4  |  -.1704443    .075201    -2.27   0.023    -.3178356    -.023053
              5  |   .0845373   .0625033     1.35   0.176     -.037967    .2070415
              6  |  -.1725677   .0751635    -2.30   0.022    -.3198854     -.02525
              7  |   .0698282   .0662493     1.05   0.292     -.060018    .1996744
              8  |   .1930588   .0706662     2.73   0.006     .0545555    .3315621
              9  |   .2417208   .0643818     3.75   0.000     .1155347    .3679069
                 |
           _cons |  -.3759091   .2215837    -1.70   0.090    -.8102052     .058387
----------------------------------------------------------------------------------

. 
. // Store the estimates
. estimates store model_hurdle

. 
. display ""


. display "Model 1 (Hurdle) estimation completed and saved as 'model_hurdle'"
Model 1 (Hurdle) estimation completed and saved as 'model_hurdle'

. 
. /*
> ==============================================================================
> STEP 3: ESTIMATE MODEL 2 - THE "TOP CORNER" MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 3: Estimating Model 2 - Top Corner Model P(wfh_share = 1 | wfh_share > 0)"
STEP 3: Estimating Model 2 - Top Corner Model P(wfh_share = 1 | wfh_share > 0)

. display "{hline 75}"
---------------------------------------------------------------------------

. 
. // Model 2: Logit for P(wfh_share = 1 | wfh_share > 0)
. // This is estimated ONLY on the subsample of workers who are not fully in-person
. logit is_full_remote ///
>     i.occupation_clean ///
>     i.work_industry ///
>     i.education_s ///
>     i.agebin ///
>     i.gender ///
>     i.race_ethnicity_s ///
>     i.censusdivision ///
>     if wfh_share > 0 ///
>     [pweight=cratio100]

Iteration 0:  Log pseudolikelihood = -4.1288396  
Iteration 1:  Log pseudolikelihood = -3.8544989  
Iteration 2:  Log pseudolikelihood =  -3.853218  
Iteration 3:  Log pseudolikelihood = -3.8532179  

Logistic regression                                    Number of obs =  32,040
                                                       Wald chi2(47) = 1379.98
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -3.8532179                      Pseudo R2     =  0.0668

----------------------------------------------------------------------------------
                 |               Robust
  is_full_remote | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
occupation_clean |
              2  |   -.549072   .2410455    -2.28   0.023    -1.021513   -.0766315
              3  |   -.490992   .2785201    -1.76   0.078    -1.036881    .0548974
              4  |  -.6644799   .2360961    -2.81   0.005     -1.12722   -.2017401
              5  |  -.3054474   .2131618    -1.43   0.152     -.723237    .1123421
              6  |  -.0255215   .2145083    -0.12   0.905    -.4459501    .3949071
              7  |  -.2537738   .2256721    -1.12   0.261    -.6960829    .1885354
              8  |   .1349029   .2134793     0.63   0.527     -.283509    .5533147
              9  |   .3425829   .2179722     1.57   0.116    -.0846348    .7698007
             10  |   .2031879    .215517     0.94   0.346    -.2192177    .6255935
             11  |   .0569419    .241326     0.24   0.813    -.4160484    .5299322
             12  |   .1855989   .3260678     0.57   0.569    -.4534823      .82468
                 |
   work_industry |
              2  |   .6839713   .1982173     3.45   0.001     .2954725     1.07247
              3  |   .1793106   .1850607     0.97   0.333    -.1834018     .542023
              4  |  -.1616387   .1985297    -0.81   0.416    -.5507497    .2274723
              5  |   -.163426   .1932797    -0.85   0.398    -.5422471    .2153952
              6  |   .2356732   .1863691     1.26   0.206    -.1296036      .60095
              7  |  -.3982318   .2053736    -1.94   0.052    -.8007565     .004293
              8  |   .2441356   .1886211     1.29   0.196    -.1255551    .6138262
              9  |  -.3946137   .1903968    -2.07   0.038    -.7677845   -.0214428
             10  |  -.3788842   .4062686    -0.93   0.351    -1.175156    .4173875
             11  |   .4566782   .1845772     2.47   0.013     .0949136    .8184429
             12  |  -.1757965   .2050248    -0.86   0.391    -.5776377    .2260448
             13  |  -.0617066   .1951763    -0.32   0.752    -.4442451    .3208318
             14  |  -.3066742   .2087107    -1.47   0.142    -.7157396    .1023912
             15  |   .1558084   .2312428     0.67   0.500    -.2974191    .6090359
             16  |  -.3165066   .2193664    -1.44   0.149    -.7464569    .1134437
             17  |  -.0624125   .1954044    -0.32   0.749    -.4453981    .3205731
             18  |  -.1342332   .2700984    -0.50   0.619    -.6636164      .39515
                 |
     education_s |
              2  |  -.0971287   .2195499    -0.44   0.658    -.5274385    .3331811
              3  |   -.225243   .2175098    -1.04   0.300    -.6515543    .2010684
              4  |  -.4837011   .2166326    -2.23   0.026    -.9082932    -.059109
              5  |  -.8179474   .2181127    -3.75   0.000    -1.245441   -.3904543
                 |
          agebin |
              3  |    .346979   .0599909     5.78   0.000     .2293991    .4645589
              4  |   .5665264    .059134     9.58   0.000     .4506258     .682427
              5  |   .9480472   .0589368    16.09   0.000     .8325332    1.063561
                 |
        2.gender |  -.4442412   .0355517   -12.50   0.000    -.5139213   -.3745611
                 |
race_ethnicity_s |
              2  |  -.0861278   .0675612    -1.27   0.202    -.2185454    .0462897
              3  |   .1326314   .0712048     1.86   0.063    -.0069275    .2721902
              4  |  -.0442568   .0515762    -0.86   0.391    -.1453442    .0568307
                 |
  censusdivision |
              2  |  -.1366453   .0942819    -1.45   0.147    -.3214344    .0481439
              3  |   .0406162   .0954993     0.43   0.671    -.1465589    .2277914
              4  |   .2657249   .1140656     2.33   0.020     .0421605    .4892893
              5  |   .1183014   .0912965     1.30   0.195    -.0606364    .2972393
              6  |   .1944491   .1127335     1.72   0.085    -.0265045    .4154026
              7  |   .0863273    .097542     0.89   0.376    -.1048515     .277506
              8  |   .1932056   .1020393     1.89   0.058    -.0067877     .393199
              9  |   .0318409   .0932358     0.34   0.733    -.1508979    .2145798
                 |
           _cons |  -.2789089     .35251    -0.79   0.429    -.9698158    .4119979
----------------------------------------------------------------------------------

. 
. // Store the estimates
. estimates store model_top_corner

. 
. display ""


. display "Model 2 (Top Corner) estimation completed and saved as 'model_top_corner'"
Model 2 (Top Corner) estimation completed and saved as 'model_top_corner'

. 
. // Display sample size for this conditional model
. count if wfh_share > 0
  32,040

. display "Sample size for Model 2 (workers with wfh_share > 0): " r(N)
Sample size for Model 2 (workers with wfh_share > 0): 32040

. 
. /*
> ==============================================================================
> STEP 4: ESTIMATE MODEL 3 - THE "INTERIOR" MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 4: Estimating Model 3 - Interior Model E[wfh_share | 0 < wfh_share < 1]"
STEP 4: Estimating Model 3 - Interior Model E[wfh_share | 0 < wfh_share < 1]

. display "{hline 75}"
---------------------------------------------------------------------------

. 
. // Model 3: Fractional Logit for E[wfh_share | 0 < wfh_share < 1]
. // This is estimated ONLY on the subsample of hybrid workers
. fracreg logit wfh_share ///
>     i.occupation_clean ///
>     i.work_industry ///
>     i.education_s ///
>     i.agebin ///
>     i.gender ///
>     i.race_ethnicity_s ///
>     i.censusdivision ///
>     if wfh_share > 0 & wfh_share < 1 ///
>     [pweight=cratio100]

Iteration 0:  Log pseudolikelihood =  -2.636141  
Iteration 1:  Log pseudolikelihood =  -2.410983  
Iteration 2:  Log pseudolikelihood = -2.4107415  
Iteration 3:  Log pseudolikelihood = -2.4107415  

Fractional logistic regression                          Number of obs = 19,849
                                                        Wald chi2(47) = 167.92
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -2.4107415                       Pseudo R2     = 0.0018

----------------------------------------------------------------------------------
                 |               Robust
       wfh_share | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
occupation_clean |
              2  |  -.0646162   .0865906    -0.75   0.456    -.2343307    .1050984
              3  |   .0395104   .1049684     0.38   0.707    -.1662239    .2452447
              4  |  -.0356286   .0891629    -0.40   0.689    -.2103847    .1391276
              5  |  -.0570228   .0767579    -0.74   0.458    -.2074655    .0934199
              6  |  -.0892561   .0785284    -1.14   0.256    -.2431691    .0646568
              7  |  -.1091385   .0832527    -1.31   0.190    -.2723108    .0540338
              8  |  -.1016178   .0773097    -1.31   0.189    -.2531421    .0499066
              9  |  -.0325757   .0803667    -0.41   0.685    -.1900915    .1249402
             10  |  -.0678354   .0798741    -0.85   0.396    -.2243857    .0887149
             11  |  -.2558959   .0939013    -2.73   0.006    -.4399392   -.0718527
             12  |  -.0147599   .1313843    -0.11   0.911    -.2722685    .2427487
                 |
   work_industry |
              2  |    .160788   .0988532     1.63   0.104    -.0329607    .3545366
              3  |   .1097441   .0881709     1.24   0.213    -.0630676    .2825558
              4  |  -.0456522   .0921271    -0.50   0.620     -.226218    .1349136
              5  |  -.0555997   .0904806    -0.61   0.539    -.2329384     .121739
              6  |   .0410246   .0909264     0.45   0.652    -.1371878    .2192371
              7  |  -.0648682   .0962094    -0.67   0.500    -.2534351    .1236987
              8  |   .0985246   .0910851     1.08   0.279    -.0799989    .2770481
              9  |  -.0381888   .0902456    -0.42   0.672    -.2150668    .1386893
             10  |   -.072274   .1447879    -0.50   0.618     -.356053    .2115051
             11  |   .0756817   .0888096     0.85   0.394    -.0983819    .2497453
             12  |   .1059044   .0998751     1.06   0.289    -.0898471    .3016559
             13  |  -.0891392   .0914844    -0.97   0.330    -.2684454     .090167
             14  |  -.0322586   .1016668    -0.32   0.751    -.2315218    .1670046
             15  |    .112345   .1058126     1.06   0.288    -.0950438    .3197338
             16  |   .1182956    .109964     1.08   0.282    -.0972299     .333821
             17  |   .1225948   .0947593     1.29   0.196      -.06313    .3083196
             18  |   .0594648   .1320213     0.45   0.652    -.1992922    .3182218
                 |
     education_s |
              2  |   .0199351   .0933757     0.21   0.831     -.163078    .2029482
              3  |  -.0120256   .0924055    -0.13   0.896     -.193137    .1690857
              4  |  -.0013587   .0916069    -0.01   0.988     -.180905    .1781876
              5  |  -.0166729   .0922949    -0.18   0.857    -.1975675    .1642217
                 |
          agebin |
              3  |  -.0155686   .0256206    -0.61   0.543    -.0657841    .0346468
              4  |  -.0216121   .0259978    -0.83   0.406    -.0725669    .0293428
              5  |    .015623   .0267947     0.58   0.560    -.0368937    .0681398
                 |
        2.gender |  -.0394047   .0176361    -2.23   0.025    -.0739708   -.0048386
                 |
race_ethnicity_s |
              2  |  -.0236091   .0317976    -0.74   0.458    -.0859312     .038713
              3  |   .0150972   .0353545     0.43   0.669    -.0541965    .0843908
              4  |  -.0785805    .024859    -3.16   0.002    -.1273031   -.0298578
                 |
  censusdivision |
              2  |  -.0258146   .0464947    -0.56   0.579    -.1169425    .0653133
              3  |  -.0127587   .0473659    -0.27   0.788    -.1055941    .0800767
              4  |  -.0641518   .0556961    -1.15   0.249    -.1733142    .0450105
              5  |  -.0215262   .0459776    -0.47   0.640    -.1116407    .0685883
              6  |  -.0628616   .0573344    -1.10   0.273     -.175235    .0495119
              7  |  -.0785038   .0493385    -1.59   0.112    -.1752056    .0181979
              8  |  -.0101079   .0523449    -0.19   0.847    -.1127021    .0924863
              9  |  -.0009928     .04605    -0.02   0.983    -.0912492    .0892636
                 |
           _cons |  -.1250696   .1525198    -0.82   0.412     -.424003    .1738638
----------------------------------------------------------------------------------

.         
. // Store the estimates
. estimates store model_interior

. 
. display ""


. display "Model 3 (Interior) estimation completed and saved as 'model_interior'"
Model 3 (Interior) estimation completed and saved as 'model_interior'

. 
. // Display sample size for this conditional model
. count if wfh_share > 0 & wfh_share < 1
  19,849

. display "Sample size for Model 3 (hybrid workers): " r(N)
Sample size for Model 3 (hybrid workers): 19849

. 
. display ""


. display "PHASE A COMPLETED: All three models estimated and saved"
PHASE A COMPLETED: All three models estimated and saved

. display "- model_hurdle: P(wfh_share > 0)"
- model_hurdle: P(wfh_share > 0)

. display "- model_top_corner: P(wfh_share = 1 | wfh_share > 0)"  
- model_top_corner: P(wfh_share = 1 | wfh_share > 0)

. display "- model_interior: E[wfh_share | 0 < wfh_share < 1]"
- model_interior: E[wfh_share | 0 < wfh_share < 1]

. 
. /*
> ==============================================================================
> PHASE B: IMPUTATION ON PREDICTION DATA (CPS/ACS)
> ==============================================================================
> */
. 
. display ""


. display "PHASE B: IMPUTATION ON PREDICTION DATA (CPS/ACS)"
PHASE B: IMPUTATION ON PREDICTION DATA (CPS/ACS)

. display "{hline 50}"
--------------------------------------------------

. 
. /*
> ==============================================================================
> STEP 5: LOAD CPS DATA AND GENERATE PREDICTIONS FROM ALL THREE MODELS
> ==============================================================================
> */
. 
. display ""


. display "STEP 5: Loading CPS/ACS data and generating predictions..."
STEP 5: Loading CPS/ACS data and generating predictions...

. 
. // Load CPS/ACS data
. clear

. import delimited "data/processed/cps_prepared_for_stata.csv", clear
(encoding automatically selected: ISO-8859-1)
(8 vars, 6,294,387 obs)

. 
. // Display basic info about prediction dataset
. display ""


. display "Prediction data summary:"
Prediction data summary:

. describe

Contains data
 Observations:     6,294,387                  
    Variables:             8                  
------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
unique_person~d str17   %17s                  
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 
------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. display "Total observations for imputation: " _N
Total observations for imputation: 6294387

. 
. // Predict P(wfh_share > 0) from Model 1
. display ""


. display "Generating predictions from Model 1 (Hurdle)..."
Generating predictions from Model 1 (Hurdle)...

. estimates restore model_hurdle
(results model_hurdle are active now)

. predict p_remote_any, pr

. label variable p_remote_any "Predicted P(wfh_share > 0) from hurdle model"

. 
. // Predict P(wfh_share = 1 | wfh_share > 0) from Model 2
. display "Generating predictions from Model 2 (Top Corner)..."
Generating predictions from Model 2 (Top Corner)...

. estimates restore model_top_corner
(results model_top_corner are active now)

. predict p_full_remote_cond, pr

. label variable p_full_remote_cond "Predicted P(wfh_share = 1 | wfh_share > 0)"

. 
. // Predict E[wfh_share | 0 < wfh_share < 1] from Model 3
. display "Generating predictions from Model 3 (Interior)..."
Generating predictions from Model 3 (Interior)...

. estimates restore model_interior
(results model_interior are active now)

. predict alpha_hybrid_pred
(option cm assumed)

. label variable alpha_hybrid_pred "Predicted E[wfh_share | 0 < wfh_share < 1]"

. 
. display ""


. display "All predictions generated successfully"
All predictions generated successfully

. summarize p_remote_any p_full_remote_cond alpha_hybrid_pred

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
p_remote_any |  6,294,387    .4314958    .1808667   .0893712   .8894763
p_full_rem~d |  6,294,387    .4597672    .1347475   .0688683   .8903234
alpha_hybr~d |  6,294,387    .4427305    .0236579   .3430104   .5260658

. 
. /*
> ==============================================================================
> STEP 6: COMBINE PREDICTIONS TO SIMULATE THE FINAL IMPUTED VARIABLE
> ==============================================================================
> */
. 
. display ""


. display "STEP 6: Combining predictions to simulate final imputed variable..."
STEP 6: Combining predictions to simulate final imputed variable...

. display "{hline 65}"
-----------------------------------------------------------------

. 
. // Set a seed for reproducibility
. set seed 12345

. display "Random seed set to 12345 for reproducibility"
Random seed set to 12345 for reproducibility

. 
. // Generate two independent random numbers for our two-stage decision
. gen u1 = runiform()

. gen u2 = runiform()

. label variable u1 "Random draw for hurdle decision"

. label variable u2 "Random draw for top corner decision"

. 
. // Initialize the final imputed variable
. gen alpha_final = .
(6,294,387 missing values generated)

. label variable alpha_final "Final Imputed WFH Share (3-Part Model)"

. 
. display ""


. display "Implementing two-stage probabilistic assignment..."
Implementing two-stage probabilistic assignment...

. 
. // --- Decision Stage 1: Are they fully in-person or not? ---
. // If their random draw is greater than their probability of doing any remote work,
. // they are assigned to be fully in-person.
. replace alpha_final = 0 if u1 > p_remote_any
(3,577,459 real changes made)

. 
. // Count assignments from stage 1
. count if alpha_final == 0
  3,577,459

. local stage1_inperson = r(N)

. display "Stage 1: " `stage1_inperson' " workers assigned to fully in-person (alpha = 0)"
Stage 1: 3577459 workers assigned to fully in-person (alpha = 0)

. 
. // --- Decision Stage 2: If not in-person, are they hybrid or fully remote? ---
. // For the remaining observations (where alpha_final is still missing), we make the second decision.
. // If their second random draw is less than or equal to their conditional probability
. // of being fully remote, they are assigned to be fully remote.
. replace alpha_final = 1 if u2 <= p_full_remote_cond & missing(alpha_final)
(1,233,459 real changes made)

. 
. // Count assignments from stage 2
. count if alpha_final == 1
  1,233,459

. local stage2_fullremote = r(N)

. display "Stage 2: " `stage2_fullremote' " workers assigned to fully remote (alpha = 1)"
Stage 2: 1233459 workers assigned to fully remote (alpha = 1)

. 
. // The rest must be hybrid. For them, we use the prediction from the fractional logit model.
. replace alpha_final = alpha_hybrid_pred if missing(alpha_final)
(1,483,469 real changes made)

. 
. // Count hybrid assignments
. count if alpha_final > 0 & alpha_final < 1
  1,483,469

. local hybrid_count = r(N)

. display "Remaining: " `hybrid_count' " workers assigned hybrid shares (0 < alpha < 1)"
Remaining: 1483469 workers assigned hybrid shares (0 < alpha < 1)

. 
. // Verify no missing values
. count if missing(alpha_final)
  0

. if r(N) > 0 {
.     display "WARNING: " r(N) " observations have missing alpha_final values!"
. }

. else {
.     display "SUCCESS: All observations have imputed alpha_final values"
SUCCESS: All observations have imputed alpha_final values
. }

. 
. 
. /*
> ==============================================================================
> STEP 7: VALIDATE THE FINAL IMPUTED VARIABLE
> ==============================================================================
> */
. 
. display ""


. display "STEP 7: Validating the final imputed variable..."
STEP 7: Validating the final imputed variable...

. display "{hline 50}"
--------------------------------------------------

. 
. display ""


. display "VALIDATION OF FINAL IMPUTED VARIABLE (3-PART MODEL):"
VALIDATION OF FINAL IMPUTED VARIABLE (3-PART MODEL):

. display "{hline 55}"
-------------------------------------------------------

. 
. // Detailed summary statistics
. summarize alpha_final, detail

           Final Imputed WFH Share (3-Part Model)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           6,294,387
25%            0              0       Sum of wgt.   6,294,387

50%            0                      Mean           .3013234
                        Largest       Std. dev.      .3903637
75%     .4652702              1
90%            1              1       Variance       .1523838
95%            1              1       Skewness         .87524
99%            1              1       Kurtosis       2.217911

. 
. // Check the proportions
. display ""


. display "DISTRIBUTION BREAKDOWN:"
DISTRIBUTION BREAKDOWN:

. 
. count if alpha_final == 0
  3,577,459

. local zeros = r(N)

. display "Fully in-person (alpha = 0): " `zeros' " observations (" %4.1f `zeros'/_N*100 "%)"
Fully in-person (alpha = 0): 3577459 observations (56.8%)

. 
. count if alpha_final == 1  
  1,233,459

. local ones = r(N)

. display "Fully remote (alpha = 1): " `ones' " observations (" %4.1f `ones'/_N*100 "%)"
Fully remote (alpha = 1): 1233459 observations (19.6%)

. 
. count if alpha_final > 0 & alpha_final < 1
  1,483,469

. local hybrid = r(N)

. display "Hybrid (0 < alpha < 1): " `hybrid' " observations (" %4.1f `hybrid'/_N*100 "%)"
Hybrid (0 < alpha < 1): 1483469 observations (23.6%)

. 
. // Additional validation checks
. display ""


. display "ADDITIONAL VALIDATION CHECKS:"
ADDITIONAL VALIDATION CHECKS:

. 
. // Check for values outside [0,1] range
. count if alpha_final < 0 | alpha_final > 1
  0

. if r(N) > 0 {
.     display "WARNING: " r(N) " observations have alpha_final outside [0,1] range!"
. } 

. else {
.     display "✓ All alpha_final values are within [0,1] range"
✓ All alpha_final values are within [0,1] range
. }

. 
. // Show distribution by key variables for face validity
. display ""


. display "MEAN ALPHA_FINAL BY OCCUPATION (Top 10 by sample size):"
MEAN ALPHA_FINAL BY OCCUPATION (Top 10 by sample size):

. preserve

. collapse (mean) alpha_final (count) n=alpha_final, by(occupation_clean)

. gsort -n

. list occupation_clean alpha_final n in 1/10, clean noobs

    occupa~n   alpha_~l         n  
           5   .3957303   1353446  
           8   .3363234   1228732  
           6   .3125753   1086001  
          10    .220651    625266  
           9   .3327215    604177  
           2   .2096447    383668  
          11   .1725682    358132  
           7   .1747288    346585  
           4   .2095493    296333  
           3   .3701383     12047  

. restore

. 
. display ""


. display "MEAN ALPHA_FINAL BY INDUSTRY (Top 10 by sample size):"
MEAN ALPHA_FINAL BY INDUSTRY (Top 10 by sample size):

. preserve  

. collapse (mean) alpha_final (count) n=alpha_final, by(work_industry)

. gsort -n

. list work_industry alpha_final n in 1/10, clean noobs

    work_i~y   alpha_~l        n  
           6   .2821151   992434  
           9   .2091732   761759  
          11   .4706748   743613  
          13   .2032748   698867  
           4   .2424116   487896  
           3   .5057276   484750  
          17   .2802914   398316  
          18   .2669782   312739  
           7   .1472345   280820  
          14   .1816797   261025  

. restore

. 
. /*
> ==============================================================================
> FINAL OUTPUT: SAVE THE IMPUTED DATASET
> ==============================================================================
> */
. 
. display ""


. display "SAVING FINAL IMPUTED DATASET..."
SAVING FINAL IMPUTED DATASET...

. display "{hline 40}"
----------------------------------------

. 
. // Add metadata about the imputation method
. gen imputation_method = "three_part_model"

. label variable imputation_method "Method used for WFH imputation"

. 
. gen imputation_date = date(c(current_date), "DMY")

. format imputation_date %td

. label variable imputation_date "Date of imputation"

. 
. // Save in Stata format
. save "output/cps_with_imputed_wfh_three_part.dta", replace
file output/cps_with_imputed_wfh_three_part.dta saved

. display "✓ Saved: output/cps_with_imputed_wfh_three_part.dta"
✓ Saved: output/cps_with_imputed_wfh_three_part.dta

. 
. // Save in CSV format  
. export delimited "output/cps_with_imputed_wfh_three_part.csv", replace
file output/cps_with_imputed_wfh_three_part.csv saved

. display "✓ Saved: output/cps_with_imputed_wfh_three_part.csv"
✓ Saved: output/cps_with_imputed_wfh_three_part.csv

. 
. // Save the model estimates
. estimates restore model_hurdle
(results model_hurdle are active now)

. estimates save "output/wfh_model_hurdle.ster", replace
file output/wfh_model_hurdle.ster saved

. display "✓ Saved: output/wfh_model_hurdle.ster"
✓ Saved: output/wfh_model_hurdle.ster

. 
. estimates restore model_top_corner  
(results model_top_corner are active now)

. estimates save "output/wfh_model_top_corner.ster", replace
file output/wfh_model_top_corner.ster saved

. display "✓ Saved: output/wfh_model_top_corner.ster"
✓ Saved: output/wfh_model_top_corner.ster

. 
. estimates restore model_interior
(results model_interior are active now)

. estimates save "output/wfh_model_interior.ster", replace  
file output/wfh_model_interior.ster saved

. display "✓ Saved: output/wfh_model_interior.ster"
✓ Saved: output/wfh_model_interior.ster

. 
. /*
> ==============================================================================
> SUMMARY AND CONCLUSION
> ==============================================================================
> */
. 
. display ""


. display "{hline 80}"
--------------------------------------------------------------------------------

. display "THREE-PART MODEL IMPUTATION COMPLETED SUCCESSFULLY"
THREE-PART MODEL IMPUTATION COMPLETED SUCCESSFULLY

. display "{hline 80}"
--------------------------------------------------------------------------------

. 
. display ""


. display "SUMMARY OF RESULTS:"
SUMMARY OF RESULTS:

. display "• Total observations processed: " _N
• Total observations processed: 6294387

. display "• Fully in-person workers (alpha = 0): " `zeros' " (" %4.1f `zeros'/_N*100 "%)"
• Fully in-person workers (alpha = 0): 3577459 (56.8%)

. display "• Fully remote workers (alpha = 1): " `ones' " (" %4.1f `ones'/_N*100 "%)"
• Fully remote workers (alpha = 1): 1233459 (19.6%)

. display "• Hybrid workers (0 < alpha < 1): " `hybrid' " (" %4.1f `hybrid'/_N*100 "%)"
• Hybrid workers (0 < alpha < 1): 1483469 (23.6%)

. 
. display ""


. display "OUTPUT FILES CREATED:"
OUTPUT FILES CREATED:

. display "• output/cps_with_imputed_wfh_three_part.dta (main output)"
• output/cps_with_imputed_wfh_three_part.dta (main output)

. display "• output/cps_with_imputed_wfh_three_part.csv (CSV version)"
• output/cps_with_imputed_wfh_three_part.csv (CSV version)

. display "• output/wfh_model_hurdle.ster (hurdle model estimates)"
• output/wfh_model_hurdle.ster (hurdle model estimates)

. display "• output/wfh_model_top_corner.ster (top corner model estimates)"
• output/wfh_model_top_corner.ster (top corner model estimates)

. display "• output/wfh_model_interior.ster (interior model estimates)"
• output/wfh_model_interior.ster (interior model estimates)

. display "• output/wfh_three_part_model_log.log (detailed log file)"
• output/wfh_three_part_model_log.log (detailed log file)

. 
. display ""


. display "The three-part model approach provides a more realistic imputation"
The three-part model approach provides a more realistic imputation

. display "that better captures the mass points at 0 and 1 in the WFH distribution."
that better captures the mass points at 0 and 1 in the WFH distribution.

. 
. // Close log file
. capture log close _all
