
. 
. display "{hline 80}"
--------------------------------------------------------------------------------

. display "WFH IMPUTATION - THREE-PART MODEL IMPLEMENTATION"
WFH IMPUTATION - THREE-PART MODEL IMPLEMENTATION

. display "{hline 80}"
--------------------------------------------------------------------------------

. 
. /*
> ==============================================================================
> PHASE A: ESTIMATION ON TRAINING DATA (SWAA)
> ==============================================================================
> */
. 
. display ""


. display "PHASE A: ESTIMATION ON TRAINING DATA (SWAA)"
PHASE A: ESTIMATION ON TRAINING DATA (SWAA)

. display "{hline 50}"
--------------------------------------------------

. 
. // Import the prepared SWAA training data
. display "Loading SWAA training data..."
Loading SWAA training data...

. import delimited "data/processed/swaa_prepared_for_stata.csv", clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 117,132 obs)

. 
. // Display basic statistics of the training data
. display ""


. display "Training data summary:"
Training data summary:

. describe

Contains data
 Observations:       117,132                  
    Variables:            10                  
------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
wfh_share       float   %9.0g                 
cratio100       float   %9.0g                 
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 
year            int     %8.0g                 
------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. summarize wfh_share, detail

                          wfh_share
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             117,132
25%            0              0       Sum of wgt.     117,132

50%           .2                      Mean           .3387499
                        Largest       Std. dev.      .3778948
75%           .6              1
90%            1              1       Variance       .1428045
95%            1              1       Skewness       .6869166
99%            1              1       Kurtosis       1.989781

. 
. display ""


. display "Original WFH share distribution in SWAA data:"
Original WFH share distribution in SWAA data:

. count if wfh_share == 0
  52,172

. display "Fully in-person (wfh_share = 0): " r(N) " (" %4.1f r(N)/_N*100 "%)"
Fully in-person (wfh_share = 0): 52172 (44.5%)

. 
. count if wfh_share == 1
  19,888

. display "Fully remote (wfh_share = 1): " r(N) " (" %4.1f r(N)/_N*100 "%)"
Fully remote (wfh_share = 1): 19888 (17.0%)

. 
. count if wfh_share > 0 & wfh_share < 1
  45,072

. display "Hybrid (0 < wfh_share < 1): " r(N) " (" %4.1f r(N)/_N*100 "%)"
Hybrid (0 < wfh_share < 1): 45072 (38.5%)

. 
. /*
> ==============================================================================
> STEP 1: CREATE DEPENDENT VARIABLES FOR THREE-PART MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 1: Creating dependent variables for three-part model..."
STEP 1: Creating dependent variables for three-part model...

. 
. // 1. Create the "hurdle" variable: Is the person NOT fully in-person?
. gen is_remote_any = (wfh_share > 0)

. label variable is_remote_any "Binary: Any remote work (wfh_share > 0)"

. 
. // 2. Create the "top corner" variable: Is the person fully remote, given they are not fully in-person?
. gen is_full_remote = (wfh_share == 1) if wfh_share > 0
(52,172 missing values generated)

. label variable is_full_remote "Binary: Fully remote, conditional on any remote work"

. 
. // 3. The original wfh_share will be used for the interior model (already exists)
. 
. // Display the new variables
. display ""


. display "New dependent variables created:"
New dependent variables created:

. tabulate is_remote_any, missing

Binary: Any |
remote work |
 (wfh_share |
       > 0) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     52,172       44.54       44.54
          1 |     64,960       55.46      100.00
------------+-----------------------------------
      Total |    117,132      100.00

. tabulate is_full_remote if wfh_share > 0, missing

    Binary: |
      Fully |
    remote, |
conditional |
     on any |
remote work |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     45,072       69.38       69.38
          1 |     19,888       30.62      100.00
------------+-----------------------------------
      Total |     64,960      100.00

. 
. /*
> ==============================================================================
> STEP 2: ESTIMATE MODEL 1 - THE "HURDLE" MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 2: Estimating Model 1 - Hurdle Model P(wfh_share > 0)"
STEP 2: Estimating Model 1 - Hurdle Model P(wfh_share > 0)

. display "{hline 60}"
------------------------------------------------------------

. 
. // Model 1: Logit for P(wfh_share > 0)
. // This is estimated on the FULL sample
. logit is_remote_any ///
>     i.occupation_clean ///
>     i.work_industry ///
>     i.education_s ///
>     i.agebin ///
>     i.gender ///
>     i.race_ethnicity_s ///
>     i.censusdivision ///
>     i.year ///
>     [pweight=cratio100]

Iteration 0:  Log pseudolikelihood = -26.222491  
Iteration 1:  Log pseudolikelihood = -22.852643  
Iteration 2:  Log pseudolikelihood = -22.845528  
Iteration 3:  Log pseudolikelihood = -22.845525  
Iteration 4:  Log pseudolikelihood = -22.845525  

Logistic regression                                    Number of obs = 117,036
                                                       Wald chi2(48) = 9284.30
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -22.845525                      Pseudo R2     =  0.1288

----------------------------------------------------------------------------------
                 |               Robust
   is_remote_any | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
occupation_clean |
              2  |    -.04899   .1039033    -0.47   0.637    -.2526368    .1546568
              3  |   .4752686   .1277315     3.72   0.000     .2249194    .7256178
              4  |  -.4792837   .1052518    -4.55   0.000    -.6855734   -.2729941
              5  |   .3161957   .0961365     3.29   0.001     .1277716    .5046198
              6  |  -.0525483   .0968458    -0.54   0.587    -.2423626     .137266
              7  |  -.5010828   .1007009    -4.98   0.000     -.698453   -.3037126
              8  |  -.3263726   .0960019    -3.40   0.001    -.5145329   -.1382124
              9  |   .1404314   .0997243     1.41   0.159    -.0550246    .3358873
             10  |  -.4386387   .0967277    -4.53   0.000    -.6282214   -.2490559
             11  |  -.6720733   .1098405    -6.12   0.000    -.8873569   -.4567898
                 |
   work_industry |
              2  |   .8474408   .1048792     8.08   0.000     .6418814       1.053
              3  |   .6488278   .0904918     7.17   0.000     .4714671    .8261884
              4  |  -.0553669   .0921548    -0.60   0.548    -.2359871    .1252532
              5  |  -.4583925   .0902799    -5.08   0.000    -.6353379   -.2814471
              6  |  -.3107508   .0881377    -3.53   0.000    -.4834974   -.1380041
              7  |  -.8656324   .0941492    -9.19   0.000    -1.050161   -.6811034
              8  |   1.077606   .0969137    11.12   0.000     .8876586    1.267553
              9  |  -.4552485   .0906463    -5.02   0.000    -.6329119    -.277585
             10  |   .0508454   .1671032     0.30   0.761    -.2766708    .3783616
             11  |   .5082208   .0891237     5.70   0.000     .3335416       .6829
             12  |   .2625031   .1093723     2.40   0.016     .0481373    .4768689
             13  |  -.7506574   .0918121    -8.18   0.000    -.9306058   -.5707089
             14  |  -.5309532   .1005994    -5.28   0.000    -.7281243    -.333782
             15  |   .0982725    .115567     0.85   0.395    -.1282346    .3247797
             16  |   .1815268   .1143652     1.59   0.112    -.0426249    .4056785
             17  |  -.3651103    .093295    -3.91   0.000    -.5479651   -.1822554
             18  |   .0965709   .0988875     0.98   0.329    -.0972452    .2903869
                 |
     education_s |
              2  |  -.0544065   .0837872    -0.65   0.516    -.2186265    .1098134
              3  |   .2292658   .0832318     2.75   0.006     .0661344    .3923972
              4  |   .8160166   .0832757     9.80   0.000     .6527992     .979234
              5  |   1.121923   .0847972    13.23   0.000     .9557234    1.288122
                 |
          agebin |
              3  |   .0775016   .0286844     2.70   0.007     .0212811     .133722
              4  |  -.0897667   .0291618    -3.08   0.002    -.1469228   -.0326105
              5  |  -.4219867   .0297909   -14.16   0.000    -.4803758   -.3635975
                 |
        2.gender |   .1030033    .019451     5.30   0.000       .06488    .1411265
                 |
race_ethnicity_s |
              2  |  -.2381084   .0405811    -5.87   0.000     -.317646   -.1585709
              3  |  -.2779208   .0429844    -6.47   0.000    -.3621686   -.1936729
              4  |  -.2556671   .0259794    -9.84   0.000    -.3065857   -.2047484
                 |
  censusdivision |
              2  |   .1662336    .054871     3.03   0.002     .0586884    .2737789
              3  |  -.1099781   .0555896    -1.98   0.048    -.2189317   -.0010245
              4  |   -.183943   .0625301    -2.94   0.003    -.3064996   -.0613863
              5  |   .0568326   .0538784     1.05   0.292     -.048767    .1624323
              6  |  -.1272385   .0612171    -2.08   0.038    -.2472218   -.0072552
              7  |    -.00459   .0564072    -0.08   0.935    -.1151461    .1059662
              8  |  -.0320593   .0619027    -0.52   0.605    -.1533864    .0892679
              9  |   .2824957   .0557306     5.07   0.000     .1732657    .3917256
                 |
            year |
           2022  |  -.0759087   .0387707    -1.96   0.050    -.1518979    .0000805
           2023  |  -.1431158    .039386    -3.63   0.000     -.220311   -.0659207
                 |
           _cons |  -.0772601   .1553657    -0.50   0.619    -.3817713    .2272512
----------------------------------------------------------------------------------

. 
. // Store the estimates
. estimates store model_hurdle

. 
. display ""


. display "Model 1 (Hurdle) estimation completed and saved as 'model_hurdle'"
Model 1 (Hurdle) estimation completed and saved as 'model_hurdle'

. 
. /*
> ==============================================================================
> STEP 3: ESTIMATE MODEL 2 - THE "TOP CORNER" MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 3: Estimating Model 2 - Top Corner Model P(wfh_share = 1 | wfh_share > 0)"
STEP 3: Estimating Model 2 - Top Corner Model P(wfh_share = 1 | wfh_share > 0)

. display "{hline 75}"
---------------------------------------------------------------------------

. 
. // Model 2: Logit for P(wfh_share = 1 | wfh_share > 0)
. // This is estimated ONLY on the subsample of workers who are not fully in-person
. logit is_full_remote ///
>     i.occupation_clean ///
>     i.work_industry ///
>     i.education_s ///
>     i.agebin ///
>     i.gender ///
>     i.race_ethnicity_s ///
>     i.censusdivision ///
>     i.year ///
>     if wfh_share > 0 ///
>     [pweight=cratio100]

Iteration 0:  Log pseudolikelihood = -11.407477  
Iteration 1:  Log pseudolikelihood = -10.304547  
Iteration 2:  Log pseudolikelihood = -10.297385  
Iteration 3:  Log pseudolikelihood = -10.297383  
Iteration 4:  Log pseudolikelihood = -10.297383  

Logistic regression                                    Number of obs =  64,921
                                                       Wald chi2(48) = 3670.30
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -10.297383                      Pseudo R2     =  0.0973

----------------------------------------------------------------------------------
                 |               Robust
  is_full_remote | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
occupation_clean |
              2  |  -.1553677     .15892    -0.98   0.328    -.4668452    .1561098
              3  |  -.1075736    .183242    -0.59   0.557    -.4667214    .2515742
              4  |  -.1325223   .1640015    -0.81   0.419    -.4539593    .1889147
              5  |    .009776   .1464882     0.07   0.947    -.2773357    .2968876
              6  |   .4898714   .1476472     3.32   0.001     .2004882    .7792547
              7  |   .2391048   .1547197     1.55   0.122    -.0641403    .5423498
              8  |   .6128809   .1464651     4.18   0.000     .3258145    .8999473
              9  |   .7654926   .1505428     5.08   0.000     .4704342    1.060551
             10  |   .6332967   .1483558     4.27   0.000     .3425246    .9240687
             11  |   .2706023   .1724993     1.57   0.117    -.0674901    .6086947
                 |
   work_industry |
              2  |   .4108679   .1378096     2.98   0.003     .1407661    .6809697
              3  |  -.1145954   .1242512    -0.92   0.356    -.3581232    .1289324
              4  |  -.4149012   .1311882    -3.16   0.002    -.6720254   -.1577771
              5  |  -.4594301   .1291461    -3.56   0.000    -.7125519   -.2063084
              6  |  -.1834872   .1252921    -1.46   0.143    -.4290551    .0620808
              7  |  -.7338085   .1425747    -5.15   0.000     -1.01325   -.4543672
              8  |  -.1603493   .1273539    -1.26   0.208    -.4099584    .0892597
              9  |  -.5652659   .1314227    -4.30   0.000    -.8228497    -.307682
             10  |  -.5367416   .2676294    -2.01   0.045    -1.061286   -.0121976
             11  |   .0787866   .1241826     0.63   0.526    -.1646069    .3221801
             12  |  -.3754413   .1459186    -2.57   0.010    -.6614366    -.089446
             13  |  -.1458849   .1313632    -1.11   0.267     -.403352    .1115822
             14  |   -.430714   .1485502    -2.90   0.004    -.7218671   -.1395609
             15  |   -.375163   .1675876    -2.24   0.025    -.7036287   -.0466974
             16  |  -.0542256   .1566996    -0.35   0.729    -.3613512       .2529
             17  |  -.3225786   .1374619    -2.35   0.019     -.591999   -.0531581
             18  |   .2019002   .1424876     1.42   0.156    -.0773705    .4811708
                 |
     education_s |
              2  |  -.1797691   .1462834    -1.23   0.219    -.4664793    .1069411
              3  |  -.1554248   .1449679    -1.07   0.284    -.4395567    .1287071
              4  |  -.5312775   .1441959    -3.68   0.000    -.8138963   -.2486588
              5  |  -.9264066   .1455731    -6.36   0.000    -1.211725   -.6410887
                 |
          agebin |
              3  |   .2469933   .0418047     5.91   0.000     .1650577    .3289289
              4  |   .5554663    .042769    12.99   0.000     .4716406     .639292
              5  |   1.128958   .0455319    24.79   0.000     1.039717    1.218199
                 |
        2.gender |  -.5335357   .0270652   -19.71   0.000    -.5865824   -.4804889
                 |
race_ethnicity_s |
              2  |  -.2029371   .0587783    -3.45   0.001    -.3181403   -.0877338
              3  |   .1005164   .0591855     1.70   0.089    -.0154851     .216518
              4  |  -.1644111   .0374607    -4.39   0.000    -.2378328   -.0909894
                 |
  censusdivision |
              2  |  -.1310853    .084624    -1.55   0.121    -.2969452    .0347746
              3  |   .0394841   .0860975     0.46   0.647     -.129264    .2082321
              4  |   .1190656   .0977217     1.22   0.223    -.0724654    .3105966
              5  |   .0661005   .0831587     0.79   0.427    -.0968876    .2290887
              6  |   .3204327   .0955345     3.35   0.001     .1331886    .5076768
              7  |   .1451793   .0867684     1.67   0.094    -.0248837    .3152423
              8  |   .1790902   .0937031     1.91   0.056    -.0045644    .3627449
              9  |  -.1506501   .0844329    -1.78   0.074    -.3161354    .0148353
                 |
            year |
           2022  |  -.0860407   .0551872    -1.56   0.119    -.1942057    .0221243
           2023  |    -.19112   .0561445    -3.40   0.001    -.3011611   -.0810789
                 |
           _cons |  -.1051681   .2345519    -0.45   0.654    -.5648813    .3545451
----------------------------------------------------------------------------------

. 
. // Store the estimates
. estimates store model_top_corner

. 
. display ""


. display "Model 2 (Top Corner) estimation completed and saved as 'model_top_corner'"
Model 2 (Top Corner) estimation completed and saved as 'model_top_corner'

. 
. // Display sample size for this conditional model
. count if wfh_share > 0
  64,960

. display "Sample size for Model 2 (workers with wfh_share > 0): " r(N)
Sample size for Model 2 (workers with wfh_share > 0): 64960

. 
. /*
> ==============================================================================
> STEP 4: ESTIMATE MODEL 3 - THE "INTERIOR" MODEL
> ==============================================================================
> */
. 
. display ""


. display "STEP 4: Estimating Model 3 - Interior Model E[wfh_share | 0 < wfh_share < 1]"
STEP 4: Estimating Model 3 - Interior Model E[wfh_share | 0 < wfh_share < 1]

. display "{hline 75}"
---------------------------------------------------------------------------

. 
. // Model 3: Fractional Logit for E[wfh_share | 0 < wfh_share < 1]
. // This is estimated ONLY on the subsample of hybrid workers
. fracreg logit wfh_share ///
>     i.occupation_clean ///
>     i.work_industry ///
>     i.education_s ///
>     i.agebin ///
>     i.gender ///
>     i.race_ethnicity_s ///
>     i.censusdivision ///
>     i.year ///
>     if wfh_share > 0 & wfh_share < 1 ///
>     [pweight=cratio100]

Iteration 0:  Log pseudolikelihood = -7.5717128  
Iteration 1:  Log pseudolikelihood = -6.9813541  
Iteration 2:  Log pseudolikelihood = -6.9806289  
Iteration 3:  Log pseudolikelihood = -6.9806289  

Fractional logistic regression                          Number of obs = 45,056
                                                        Wald chi2(48) = 288.74
                                                        Prob > chi2   = 0.0000
Log pseudolikelihood = -6.9806289                       Pseudo R2     = 0.0018

----------------------------------------------------------------------------------
                 |               Robust
       wfh_share | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
occupation_clean |
              2  |  -.0187887   .0521014    -0.36   0.718    -.1209055    .0833281
              3  |  -.0059163   .0618807    -0.10   0.924    -.1272004    .1153677
              4  |  -.0700883   .0545574    -1.28   0.199    -.1770189    .0368423
              5  |  -.1125479   .0469992    -2.39   0.017    -.2046647    -.020431
              6  |  -.0949164   .0489536    -1.94   0.053    -.1908637    .0010308
              7  |  -.0883136    .052382    -1.69   0.092    -.1909804    .0143532
              8  |  -.1201553   .0481796    -2.49   0.013    -.2145857   -.0257249
              9  |  -.0609612   .0519777    -1.17   0.241    -.1628356    .0409131
             10  |  -.1089314   .0499778    -2.18   0.029    -.2068861   -.0109767
             11  |  -.1385702   .0657821    -2.11   0.035    -.2675008   -.0096396
                 |
   work_industry |
              2  |   .1673361   .0600781     2.79   0.005     .0495851    .2850871
              3  |    .101358   .0500211     2.03   0.043     .0033185    .1993975
              4  |  -.0682695   .0525882    -1.30   0.194    -.1713404    .0348014
              5  |  -.0158698   .0519503    -0.31   0.760    -.1176905    .0859508
              6  |   .0475343   .0512316     0.93   0.353    -.0528777    .1479464
              7  |  -.0724103    .057842    -1.25   0.211    -.1857785     .040958
              8  |    .088127   .0515917     1.71   0.088    -.0129908    .1892448
              9  |  -.1058498   .0524482    -2.02   0.044    -.2086463   -.0030533
             10  |   .1595618   .1051055     1.52   0.129    -.0464412    .3655648
             11  |   .0576995   .0507291     1.14   0.255    -.0417278    .1571268
             12  |   .0414441   .0606053     0.68   0.494      -.07734    .1602282
             13  |   .0019234   .0552534     0.03   0.972    -.1063714    .1102181
             14  |  -.0295798    .064915    -0.46   0.649    -.1568109    .0976513
             15  |   .0841375    .068023     1.24   0.216    -.0491851    .2174602
             16  |   .1054835   .0738561     1.43   0.153    -.0392717    .2502387
             17  |   .1062668   .0570519     1.86   0.063    -.0055529    .2180865
             18  |   .0116858   .0630842     0.19   0.853    -.1119569    .1353285
                 |
     education_s |
              2  |  -.0702433   .0759348    -0.93   0.355    -.2190728    .0785862
              3  |  -.0230098   .0754482    -0.30   0.760    -.1708856     .124866
              4  |  -.0254601    .074645    -0.34   0.733    -.1717616    .1208414
              5  |  -.0491355   .0748576    -0.66   0.512    -.1958538    .0975828
                 |
          agebin |
              3  |   -.022183   .0172997    -1.28   0.200    -.0560898    .0117237
              4  |   -.018315   .0184793    -0.99   0.322    -.0545338    .0179039
              5  |   .0076721   .0221755     0.35   0.729     -.035791    .0511352
                 |
        2.gender |  -.0241903   .0124245    -1.95   0.052    -.0485418    .0001612
                 |
race_ethnicity_s |
              2  |  -.0625095   .0274802    -2.27   0.023    -.1163697   -.0086494
              3  |  -.0583564   .0292291    -2.00   0.046    -.1156444   -.0010684
              4  |  -.1106949    .017604    -6.29   0.000    -.1451981   -.0761916
                 |
  censusdivision |
              2  |   .0665762   .0385927     1.73   0.085    -.0090641    .1422165
              3  |   .0543695   .0406397     1.34   0.181    -.0252828    .1340218
              4  |  -.0024606    .046114    -0.05   0.957    -.0928425    .0879212
              5  |   .0519537   .0386944     1.34   0.179    -.0238859    .1277934
              6  |   .0135654   .0456711     0.30   0.766    -.0759483     .103079
              7  |   .0285179   .0405215     0.70   0.482    -.0509028    .1079386
              8  |   .0671492   .0439651     1.53   0.127    -.0190208    .1533191
              9  |   .0635174   .0384812     1.65   0.099    -.0119044    .1389393
                 |
            year |
           2022  |  -.1400398   .0247596    -5.66   0.000    -.1885678   -.0915118
           2023  |  -.1799703    .025098    -7.17   0.000    -.2291615   -.1307792
                 |
           _cons |   .0765551   .0990264     0.77   0.439    -.1175331    .2706433
----------------------------------------------------------------------------------

.         
. // Store the estimates
. estimates store model_interior

. 
. display ""


. display "Model 3 (Interior) estimation completed and saved as 'model_interior'"
Model 3 (Interior) estimation completed and saved as 'model_interior'

. 
. // Display sample size for this conditional model
. count if wfh_share > 0 & wfh_share < 1
  45,072

. display "Sample size for Model 3 (hybrid workers): " r(N)
Sample size for Model 3 (hybrid workers): 45072

. 
. display ""


. display "PHASE A COMPLETED: All three models estimated and saved"
PHASE A COMPLETED: All three models estimated and saved

. display "- model_hurdle: P(wfh_share > 0)"
- model_hurdle: P(wfh_share > 0)

. display "- model_top_corner: P(wfh_share = 1 | wfh_share > 0)"  
- model_top_corner: P(wfh_share = 1 | wfh_share > 0)

. display "- model_interior: E[wfh_share | 0 < wfh_share < 1]"
- model_interior: E[wfh_share | 0 < wfh_share < 1]

. 
. /*
> ==============================================================================
> PHASE B: IMPUTATION ON PREDICTION DATA (ACS)
> ==============================================================================
> */
. 
. display ""


. display "PHASE B: IMPUTATION ON PREDICTION DATA (ACS)"
PHASE B: IMPUTATION ON PREDICTION DATA (ACS)

. display "{hline 50}"
--------------------------------------------------

. 
. /*
> ==============================================================================
> STEP 5: LOAD ACS DATA AND GENERATE PREDICTIONS FROM ALL THREE MODELS
> ==============================================================================
> */
. 
. display ""


. display "STEP 5: Loading ACS data and generating predictions..."
STEP 5: Loading ACS data and generating predictions...

. 
. // Load ACS data
. clear

. import delimited "data/processed/acs_prepared_for_stata.csv", clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 2,045,735 obs)

. 
. // Display basic info about prediction dataset
. display ""


. display "Prediction data summary:"
Prediction data summary:

. describe

Contains data
 Observations:     2,045,735                  
    Variables:            10                  
------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
unique_person~d str17   %17s                  
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 
year            int     %8.0g                 
wfh             byte    %8.0g                 
------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. display "Total observations for imputation: " _N
Total observations for imputation: 2045735

. 
. // Predict P(wfh_share > 0) from Model 1
. display ""


. display "Generating predictions from Model 1 (Hurdle)..."
Generating predictions from Model 1 (Hurdle)...

. estimates restore model_hurdle
(results model_hurdle are active now)

. predict p_remote_any, pr

. label variable p_remote_any "Predicted P(wfh_share > 0) from hurdle model"

. 
. // Predict P(wfh_share = 1 | wfh_share > 0) from Model 2
. display "Generating predictions from Model 2 (Top Corner)..."
Generating predictions from Model 2 (Top Corner)...

. estimates restore model_top_corner
(results model_top_corner are active now)

. predict p_full_remote_cond, pr

. label variable p_full_remote_cond "Predicted P(wfh_share = 1 | wfh_share > 0)"

. 
. // Predict E[wfh_share | 0 < wfh_share < 1] from Model 3
. display "Generating predictions from Model 3 (Interior)..."
Generating predictions from Model 3 (Interior)...

. estimates restore model_interior
(results model_interior are active now)

. predict alpha_hybrid_pred
(option cm assumed)

. label variable alpha_hybrid_pred "Predicted E[wfh_share | 0 < wfh_share < 1]"

. 
. display ""


. display "All predictions generated successfully"
All predictions generated successfully

. summarize p_remote_any p_full_remote_cond alpha_hybrid_pred

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
p_remote_any |  2,045,735    .4298882    .1945483   .0631898   .9323615
p_full_rem~d |  2,045,735     .496032    .1570623   .0565571   .9217002
alpha_hybr~d |  2,045,735     .454488    .0270492   .3706517   .5600998

. 
. /*
> ==============================================================================
> STEP 6: COMBINE PREDICTIONS TO SIMULATE THE FINAL IMPUTED VARIABLE
> ==============================================================================
> */
. 
. display ""


. display "STEP 6: Combining predictions to simulate final imputed variable..."
STEP 6: Combining predictions to simulate final imputed variable...

. display "{hline 65}"
-----------------------------------------------------------------

. 
. // Set a seed for reproducibility
. set seed 12345

. display "Random seed set to 12345 for reproducibility"
Random seed set to 12345 for reproducibility

. 
. // Generate two independent random numbers for our two-stage decision
. gen u1 = runiform()

. gen u2 = runiform()

. label variable u1 "Random draw for hurdle decision"

. label variable u2 "Random draw for top corner decision"

. 
. // Initialize the final imputed variable
. gen alpha_final = .
(2,045,735 missing values generated)

. label variable alpha_final "Final Imputed WFH Share (3-Part Model)"

. 
. display ""


. display "Implementing two-stage probabilistic assignment..."
Implementing two-stage probabilistic assignment...

. 
. // --- Decision Stage 1: Are they fully in-person or not? ---
. // If their random draw is greater than their probability of doing any remote work,
. // they are assigned to be fully in-person.
. replace alpha_final = 0 if u1 > p_remote_any
(1,166,228 real changes made)

. 
. // Count assignments from stage 1
. count if alpha_final == 0
  1,166,228

. local stage1_inperson = r(N)

. display "Stage 1: " `stage1_inperson' " workers assigned to fully in-person (alpha = 0)"
Stage 1: 1166228 workers assigned to fully in-person (alpha = 0)

. 
. // --- Decision Stage 2: If not in-person, are they hybrid or fully remote? ---
. // For the remaining observations (where alpha_final is still missing), we make the second decision.
. // If their second random draw is less than or equal to their conditional probability
. // of being fully remote, they are assigned to be fully remote.
. replace alpha_final = 1 if u2 <= p_full_remote_cond & missing(alpha_final)
(415,689 real changes made)

. 
. // Count assignments from stage 2
. count if alpha_final == 1
  415,689

. local stage2_fullremote = r(N)

. display "Stage 2: " `stage2_fullremote' " workers assigned to fully remote (alpha = 1)"
Stage 2: 415689 workers assigned to fully remote (alpha = 1)

. 
. // The rest must be hybrid. For them, we use the prediction from the fractional logit model.
. replace alpha_final = alpha_hybrid_pred if missing(alpha_final)
(463,818 real changes made)

. 
. // Count hybrid assignments
. count if alpha_final > 0 & alpha_final < 1
  463,818

. local hybrid_count = r(N)

. display "Remaining: " `hybrid_count' " workers assigned hybrid shares (0 < alpha < 1)"
Remaining: 463818 workers assigned hybrid shares (0 < alpha < 1)

. 
. // Verify no missing values
. count if missing(alpha_final)
  0

. if r(N) > 0 {
.     display "WARNING: " r(N) " observations have missing alpha_final values!"
. }

. else {
.     display "SUCCESS: All observations have imputed alpha_final values"
SUCCESS: All observations have imputed alpha_final values
. }

. 
. 
. /*
> ==============================================================================
> STEP 7: VALIDATE THE FINAL IMPUTED VARIABLE
> ==============================================================================
> */
. 
. display ""


. display "STEP 7: Validating the final imputed variable..."
STEP 7: Validating the final imputed variable...

. display "{hline 50}"
--------------------------------------------------

. 
. display ""


. display "VALIDATION OF FINAL IMPUTED VARIABLE (3-PART MODEL):"
VALIDATION OF FINAL IMPUTED VARIABLE (3-PART MODEL):

. display "{hline 55}"
-------------------------------------------------------

. 
. // Detailed summary statistics
. summarize alpha_final, detail

           Final Imputed WFH Share (3-Part Model)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs           2,045,735
25%            0              0       Sum of wgt.   2,045,735

50%            0                      Mean           .3065786
                        Largest       Std. dev.      .3956082
75%     .4799146              1
90%            1              1       Variance       .1565058
95%            1              1       Skewness       .8423019
99%            1              1       Kurtosis        2.12911

. 
. // Check the proportions
. display ""


. display "DISTRIBUTION BREAKDOWN:"
DISTRIBUTION BREAKDOWN:

. 
. count if alpha_final == 0
  1,166,228

. local zeros = r(N)

. display "Fully in-person (alpha = 0): " `zeros' " observations (" %4.1f `zeros'/_N*100 "%)"
Fully in-person (alpha = 0): 1166228 observations (57.0%)

. 
. count if alpha_final == 1  
  415,689

. local ones = r(N)

. display "Fully remote (alpha = 1): " `ones' " observations (" %4.1f `ones'/_N*100 "%)"
Fully remote (alpha = 1): 415689 observations (20.3%)

. 
. count if alpha_final > 0 & alpha_final < 1
  463,818

. local hybrid = r(N)

. display "Hybrid (0 < alpha < 1): " `hybrid' " observations (" %4.1f `hybrid'/_N*100 "%)"
Hybrid (0 < alpha < 1): 463818 observations (22.7%)

. 
. // Additional validation checks
. display ""


. display "ADDITIONAL VALIDATION CHECKS:"
ADDITIONAL VALIDATION CHECKS:

. 
. // Check for values outside [0,1] range
. count if alpha_final < 0 | alpha_final > 1
  0

. if r(N) > 0 {
.     display "WARNING: " r(N) " observations have alpha_final outside [0,1] range!"
. } 

. else {
.     display "✓ All alpha_final values are within [0,1] range"
✓ All alpha_final values are within [0,1] range
. }

. 
. // Show distribution by key variables for face validity
. display ""


. display "MEAN ALPHA_FINAL BY OCCUPATION (Top 10 by sample size):"
MEAN ALPHA_FINAL BY OCCUPATION (Top 10 by sample size):

. preserve

. collapse (mean) alpha_final (count) n=alpha_final, by(occupation_clean)

. gsort -n

. list occupation_clean alpha_final n in 1/10, clean noobs

    occupa~n   alpha_~l        n  
           8   .3422609   478658  
           5   .4018126   446733  
           6   .3085755   321605  
          10   .2183818   210072  
           9   .3484392   169910  
          11   .1409663   122740  
           2   .2499431   114636  
           7   .1656868    91657  
           4   .1979635    86445  
           3   .3894693     3279  

. restore

. 
. display ""


. display "MEAN ALPHA_FINAL BY INDUSTRY (Top 10 by sample size):"
MEAN ALPHA_FINAL BY INDUSTRY (Top 10 by sample size):

. preserve  

. collapse (mean) alpha_final (count) n=alpha_final, by(work_industry)

. gsort -n

. list work_industry alpha_final n in 1/10, clean noobs

    work_i~y   alpha_~l        n  
           6   .2686846   336511  
          11   .4600685   278992  
           9   .2034922   229101  
          13   .2053753   218027  
           4   .2717141   157689  
           3   .4932926   151289  
          17    .267238   133361  
          18   .3424576    96608  
          14   .1863031    87779  
           5    .251541    83630  

. restore

. 
. /*
> ==============================================================================
> FINAL OUTPUT: SAVE THE IMPUTED DATASET
> ==============================================================================
> */
. 
. display ""


. display "SAVING FINAL IMPUTED DATASET..."
SAVING FINAL IMPUTED DATASET...

. display "{hline 40}"
----------------------------------------

. 
. // Add metadata about the imputation method
. gen imputation_method = "three_part_model"

. label variable imputation_method "Method used for WFH imputation"

. 
. gen imputation_date = date(c(current_date), "DMY")

. format imputation_date %td

. label variable imputation_date "Date of imputation"

. 
. // Save in Stata format
. save "output/acs_with_imputed_wfh_three_part.dta", replace
file output/acs_with_imputed_wfh_three_part.dta saved

. display "✓ Saved: output/acs_with_imputed_wfh_three_part.dta"
✓ Saved: output/acs_with_imputed_wfh_three_part.dta

. 
. // Save in CSV format  
. // export delimited "output/acs_with_imputed_wfh_three_part.csv", replace
. // display "✓ Saved: output/acs_with_imputed_wfh_three_part.csv"
. 
. // Save the model estimates
. estimates restore model_hurdle
(results model_hurdle are active now)

. estimates save "output/wfh_model_hurdle.ster", replace
file output/wfh_model_hurdle.ster saved

. display "✓ Saved: output/wfh_model_hurdle.ster"
✓ Saved: output/wfh_model_hurdle.ster

. 
. estimates restore model_top_corner  
(results model_top_corner are active now)

. estimates save "output/wfh_model_top_corner.ster", replace
file output/wfh_model_top_corner.ster saved

. display "✓ Saved: output/wfh_model_top_corner.ster"
✓ Saved: output/wfh_model_top_corner.ster

. 
. estimates restore model_interior
(results model_interior are active now)

. estimates save "output/wfh_model_interior.ster", replace  
file output/wfh_model_interior.ster saved

. display "✓ Saved: output/wfh_model_interior.ster"
✓ Saved: output/wfh_model_interior.ster

. 
. /*
> ==============================================================================
> SUMMARY AND CONCLUSION
> ==============================================================================
> */
. 
. display ""


. display "{hline 80}"
--------------------------------------------------------------------------------

. display "THREE-PART MODEL IMPUTATION COMPLETED SUCCESSFULLY"
THREE-PART MODEL IMPUTATION COMPLETED SUCCESSFULLY

. display "{hline 80}"
--------------------------------------------------------------------------------

. 
. display ""


. display "SUMMARY OF RESULTS:"
SUMMARY OF RESULTS:

. display "• Total observations processed: " _N
• Total observations processed: 2045735

. display "• Fully in-person workers (alpha = 0): " `zeros' " (" %4.1f `zeros'/_N*100 "%)"
• Fully in-person workers (alpha = 0): 1166228 (57.0%)

. display "• Fully remote workers (alpha = 1): " `ones' " (" %4.1f `ones'/_N*100 "%)"
• Fully remote workers (alpha = 1): 415689 (20.3%)

. display "• Hybrid workers (0 < alpha < 1): " `hybrid' " (" %4.1f `hybrid'/_N*100 "%)"
• Hybrid workers (0 < alpha < 1): 463818 (22.7%)

. 
. display ""


. display "OUTPUT FILES CREATED:"
OUTPUT FILES CREATED:

. display "• output/acs_with_imputed_wfh_three_part.dta (main output)"
• output/acs_with_imputed_wfh_three_part.dta (main output)

. display "• output/acs_with_imputed_wfh_three_part.csv (CSV version)"
• output/acs_with_imputed_wfh_three_part.csv (CSV version)

. display "• output/wfh_model_hurdle.ster (hurdle model estimates)"
• output/wfh_model_hurdle.ster (hurdle model estimates)

. display "• output/wfh_model_top_corner.ster (top corner model estimates)"
• output/wfh_model_top_corner.ster (top corner model estimates)

. display "• output/wfh_model_interior.ster (interior model estimates)"
• output/wfh_model_interior.ster (interior model estimates)

. display "• output/wfh_three_part_model_log.log (detailed log file)"
• output/wfh_three_part_model_log.log (detailed log file)

. 
. display ""


. display "The three-part model approach provides a more realistic imputation"
The three-part model approach provides a more realistic imputation

. display "that better captures the mass points at 0 and 1 in the WFH distribution."
that better captures the mass points at 0 and 1 in the WFH distribution.

. 
. // Close log file
. capture log close _all
