
. 
. display "{hline 80}"
--------------------------------------------------------------------------------

. display "WFH IMPUTATION - ECONOMETRIC MODELING & IMPUTATION"
WFH IMPUTATION - ECONOMETRIC MODELING & IMPUTATION

. display "{hline 80}"
--------------------------------------------------------------------------------

. 
. /*
> ==============================================================================
> PHASE 3.1: IMPORT PREPARED SWAA DATA
> ==============================================================================
> */
. 
. display ""


. display "PHASE 3.1: IMPORTING PREPARED SWAA DATA"
PHASE 3.1: IMPORTING PREPARED SWAA DATA

. display "{hline 50}"
--------------------------------------------------

. 
. // Import the prepared SWAA training data
. // Note: The filename corresponds to SWAA_OUTPUT_FILE in the Python script
. import delimited "data/processed/swaa_prepared_for_stata.csv", clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 117,132 obs)

. 
. // Display basic information about the SWAA data
. describe

Contains data
 Observations:       117,132                  
    Variables:            10                  
------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
wfh_share       float   %9.0g                 
cratio100       float   %9.0g                 
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 
year            int     %8.0g                 
------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   wfh_share |    117,132    .3387499    .3778948          0          1
   cratio100 |    117,132    .0003259    .0003141          0   .0016752
occupation~n |    117,132    6.795692    2.497542          1         11
work_indus~y |    117,132     8.14499    4.330019          1         18
 education_s |    117,132    3.637947    1.116553          1          5
-------------+---------------------------------------------------------
      agebin |    117,132    3.455059    .9506006          2          5
      gender |    117,132    1.508631    .4999276          1          2
race_ethni~s |    117,132    3.397876    1.094042          1          4
censusdivi~n |    117,132    5.181812     2.56571          1          9
        year |    117,132    2022.406     .599379       2021       2023

. 
. // Check the dependent variable
. display ""


. display "Dependent Variable Summary:"
Dependent Variable Summary:

. summarize wfh_share, detail

                          wfh_share
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             117,132
25%            0              0       Sum of wgt.     117,132

50%           .2                      Mean           .3387499
                        Largest       Std. dev.      .3778948
75%           .6              1
90%            1              1       Variance       .1428045
95%            1              1       Skewness       .6869166
99%            1              1       Kurtosis       1.989781

. 
. // Check for any issues with the WFH share variable
. count if wfh_share < 0
  0

. count if wfh_share > 1
  0

. count if missing(wfh_share)
  0

. 
. /*
> ==============================================================================
> PHASE 3.2: ESTIMATE THE FRACTIONAL LOGIT MODEL
> ==============================================================================
> */
. 
. display ""


. display "PHASE 3.2: ESTIMATING FRACTIONAL LOGIT MODEL"
PHASE 3.2: ESTIMATING FRACTIONAL LOGIT MODEL

. display "{hline 50}"
--------------------------------------------------

. 
. // Check which predictor variables are available
. describe occupation_clean work_industry education_s agebin gender race_ethnicity_s censusdivision

Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 

. 
. // Estimate the fractional logit model with population weights
. display "Estimating fractional logit model..."
Estimating fractional logit model...

. 
. // Basic model - adjust based on available variables
. capture {

. 
. // If full model fails, try simplified version
. if _rc != 0 {
.     display "Full model failed, trying simplified version..."
.     
.     // Check which variables actually exist and have variation
.     foreach var of varlist occupation_clean work_industry education_s agebin gender race_ethnicity_s censusdivision {
  2.         capture confirm variable `var'
  3.         if _rc == 0 {
  4.             display "Variable `var' exists"
  5.             tab `var', missing
  6.         }
  7.         else {
  8.             display "Variable `var' not found"
  9.         }
 10.     }
.     
.     // Simplified model with core variables
.     fracreg logit wfh_share ///
>         i.occupation_clean ///
>         i.education_s ///
>         i.gender ///
>         [pweight=cratio100], vce(robust)
. }

. 
. // Store the model results
. estimates store wfh_model

. 
. // Display model results
. display ""


. display "Model Estimation Results:"
Model Estimation Results:

. estimates replay wfh_model

------------------------------------------------------------------------------------------------------------------------
Model wfh_model
------------------------------------------------------------------------------------------------------------------------

Fractional logistic regression                         Number of obs = 117,036
                                                       Wald chi2(46) = 6994.12
                                                       Prob > chi2   =  0.0000
Log pseudolikelihood = -21.582591                      Pseudo R2     =  0.0678

----------------------------------------------------------------------------------
                 |               Robust
       wfh_share | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
occupation_clean |
              2  |  -.1154289   .0848765    -1.36   0.174    -.2817838     .050926
              3  |   .2667656   .1008786     2.64   0.008     .0690472     .464484
              4  |  -.4383031   .0871084    -5.03   0.000    -.6090324   -.2675737
              5  |   .1108857   .0777473     1.43   0.154    -.0414962    .2632676
              6  |   .0511706   .0788728     0.65   0.516    -.1034172    .2057583
              7  |   -.372838   .0834446    -4.47   0.000    -.5363865   -.2092895
              8  |  -.0936947   .0782362    -1.20   0.231    -.2470348    .0596454
              9  |   .2953766   .0817652     3.61   0.000     .1351196    .4556335
             10  |  -.2208291   .0792385    -2.79   0.005    -.3761336   -.0655246
             11  |  -.5538333   .0941878    -5.88   0.000    -.7384379   -.3692287
                 |
   work_industry |
              2  |   .7738821   .0850733     9.10   0.000     .6071416    .9406227
              3  |   .3865961   .0732105     5.28   0.000     .2431061     .530086
              4  |  -.1754365   .0764534    -2.29   0.022    -.3252824   -.0255907
              5  |  -.5045771   .0757332    -6.66   0.000    -.6530114   -.3561429
              6  |  -.3117617   .0735393    -4.24   0.000    -.4558961   -.1676273
              7  |  -.9425909   .0808726   -11.66   0.000    -1.101098   -.7840836
              8  |   .6084467   .0759507     8.01   0.000     .4595861    .7573073
              9  |  -.5625464   .0760536    -7.40   0.000    -.7116088    -.413484
             10  |  -.0266186   .1392664    -0.19   0.848    -.2995757    .2463384
             11  |   .3961436   .0734654     5.39   0.000      .252154    .5401332
             12  |   .1142399   .0874319     1.31   0.191    -.0571235    .2856032
             13  |  -.6827383   .0777828    -8.78   0.000    -.8351897   -.5302868
             14  |  -.5514912   .0866438    -6.37   0.000    -.7213099   -.3816725
             15  |  -.0087474   .0964825    -0.09   0.928    -.1978496    .1803548
             16  |   .1585213   .0958439     1.65   0.098    -.0293293    .3463719
             17  |  -.3333067   .0787565    -4.23   0.000    -.4876667   -.1789467
             18  |   .1900459   .0833543     2.28   0.023     .0266744    .3534174
                 |
     education_s |
              2  |  -.0961452   .0824501    -1.17   0.244    -.2577445    .0654541
              3  |   .1634638   .0818462     2.00   0.046     .0030481    .3238795
              4  |   .4833945   .0817751     5.91   0.000     .3231183    .6436707
              5  |    .524554   .0827735     6.34   0.000      .362321     .686787
                 |
          agebin |
              3  |   .1104913   .0246226     4.49   0.000     .0622318    .1587508
              4  |   .0861171   .0253626     3.40   0.001     .0364074    .1358269
              5  |   .0022329   .0263214     0.08   0.932    -.0493561    .0538218
                 |
        2.gender |  -.0900069   .0170368    -5.28   0.000    -.1233984   -.0566153
                 |
race_ethnicity_s |
              2  |  -.2377236   .0349972    -6.79   0.000    -.3063168   -.1691304
              3  |  -.1692367   .0366636    -4.62   0.000    -.2410961   -.0973773
              4  |   -.285602   .0225877   -12.64   0.000     -.329873   -.2413309
                 |
  censusdivision |
              2  |   .0633875   .0493838     1.28   0.199     -.033403    .1601779
              3  |  -.0615958   .0506632    -1.22   0.224    -.1608939    .0377022
              4  |  -.1155345   .0573232    -2.02   0.044    -.2278859   -.0031831
              5  |   .0711214   .0488516     1.46   0.145    -.0246259    .1668687
              6  |  -.0233199   .0563514    -0.41   0.679    -.1337666    .0871269
              7  |   .0277791   .0512257     0.54   0.588    -.0726215    .1281797
              8  |   .0410976   .0555833     0.74   0.460    -.0678436    .1500388
              9  |   .1377695   .0498248     2.77   0.006     .0401148    .2354243
                 |
           _cons |  -.7247181   .1343297    -5.40   0.000    -.9879995   -.4614367
----------------------------------------------------------------------------------

. 
. // Save model estimates
. estimates save "output/wfh_model_estimates", replace
file output/wfh_model_estimates.ster saved

. 
. /*
> ==============================================================================
> PHASE 3.3: IMPORT HARMONIZED ACS DATA
> ==============================================================================
> */
. 
. display ""


. display "PHASE 3.3: IMPORTING HARMONIZED ACS DATA"
PHASE 3.3: IMPORTING HARMONIZED ACS DATA

. display "{hline 50}"
--------------------------------------------------

. 
. // Clear memory and import ACS prediction data
. // Note: The filename corresponds to ACS_OUTPUT_FILE in the Python script
. clear

. import delimited "data/processed/acs_prepared_for_stata.csv", clear
(encoding automatically selected: ISO-8859-1)
(10 vars, 2,045,735 obs)

. 
. // Display basic information about the ACS data
. describe

Contains data
 Observations:     2,045,735                  
    Variables:            10                  
------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
unique_person~d str17   %17s                  
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 
year            int     %8.0g                 
wfh             byte    %8.0g                 
------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
unique_per~d |          0
occupation~n |  2,045,735    6.940829    2.298788          2         11
work_indus~y |  2,045,735    9.434431    4.554154          1         18
 education_s |  2,045,735    3.209636    1.108007          1          5
      agebin |  2,045,735    3.820981    1.222195          1          6
-------------+---------------------------------------------------------
      gender |  2,045,735    1.469466    .4990669          1          2
race_ethni~s |  2,045,735    2.845348    .3615727          2          3
censusdivi~n |  2,045,735    5.119842    2.346863          1          9
        year |  2,045,735    2022.031    .8135742       2021       2023
         wfh |  2,045,735    .1719597    .3773455          0          1

. 
. // Check sample size
. display "ACS sample size: " _N
ACS sample size: 2045735

. 
. // Verify unique identifier exists and is unique
. capture confirm string variable unique_person_id

. if _rc == 0 {
.     display "✓ Found unique_person_id variable"
✓ Found unique_person_id variable
.     
.     // Check for uniqueness
.     duplicates report unique_person_id

Duplicates in terms of unique_person_id

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |      2045735             0
--------------------------------------
.     local dups = r(N) - r(unique_N)
.     
.     if `dups' == 0 {
.         display "✓ unique_person_id is properly unique"
.     }
.     else {
.         display "⚠ WARNING: `dups' duplicate unique_person_id values found"
⚠ WARNING: . duplicate unique_person_id values found
.     }
. }

. else {
.     display "✗ ERROR: unique_person_id variable not found!"
.     display "Cannot proceed without unique identifier for merging back to original data"
.     exit 1
. }

. 
. /*
> ==============================================================================
> PHASE 3.4: GENERATE PREDICTIONS
> ==============================================================================
> */
. 
. display ""


. display "PHASE 3.4: GENERATING PREDICTIONS"
PHASE 3.4: GENERATING PREDICTIONS

. display "{hline 50}"
--------------------------------------------------

. 
. // Restore the model
. estimates restore wfh_model
(results wfh_model are active now)

. 
. // Generate predictions
. display "Generating WFH share predictions..."
Generating WFH share predictions...

. predict alpha
(option cm assumed)

. 
. // Check predictions
. display ""


. display "Prediction Summary:"
Prediction Summary:

. summarize alpha, detail

                Conditional mean of wfh_share
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0999197       .0634432
 5%      .122755       .0634432
10%     .1504515        .063576       Obs           2,045,735
25%     .2125273        .063576       Sum of wgt.   2,045,735

50%     .2828304                      Mean            .306402
                        Largest       Std. dev.      .1282871
75%     .3926187       .7055226
90%     .5097285       .7071269       Variance       .0164576
95%      .542354       .7071269       Skewness       .5112537
99%     .5915445       .7073576       Kurtosis        2.36827

. 
. // Validate predictions are in valid range [0,1]
. count if alpha < 0
  0

. count if alpha > 1
  0

. count if missing(alpha)
  0

. 
. // Display distribution of predictions
. display ""


. display "Distribution of Predicted WFH Shares:"
Distribution of Predicted WFH Shares:

. histogram alpha, frequency title("Distribution of Predicted WFH Shares") ///
>     xlabel(0(0.1)1) ylabel(, format(%9.0fc))
(bin=63, start=.06344317, width=.01022086)

. 
. /*
> ==============================================================================
> PHASE 3.5: SAVE THE FINAL IMPUTED DATASET
> ==============================================================================
> */
. 
. display ""


. display "PHASE 3.5: SAVING FINAL IMPUTED DATASET"
PHASE 3.5: SAVING FINAL IMPUTED DATASET

. display "{hline 50}"
--------------------------------------------------

. 
. // Compress to optimize file size
. compress
  (0 bytes saved)

. 
. // Add labels for clarity
. label variable alpha "Predicted WFH Share (Imputed from SWAA)"

. label variable unique_person_id "Unique Person Identifier (SAMPLE_SERIAL_PERNUM)"

. 
. // Display final dataset information
. describe

Contains data
 Observations:     2,045,735                  
    Variables:            11                  
------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
------------------------------------------------------------------------------------------------------------------------
unique_person~d str17   %17s                  Unique Person Identifier (SAMPLE_SERIAL_PERNUM)
occupation_cl~n byte    %8.0g                 
work_industry   byte    %8.0g                 
education_s     byte    %8.0g                 
agebin          byte    %8.0g                 
gender          byte    %8.0g                 
race_ethnicit~s byte    %8.0g                 
censusdivision  byte    %8.0g                 
year            int     %8.0g                 
wfh             byte    %8.0g                 
alpha           float   %9.0g                 Predicted WFH Share (Imputed from SWAA)
------------------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. summarize alpha

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
       alpha |  2,045,735     .306402    .1282871   .0634432   .7073576

. 
. // Verify we still have the unique identifier
. display ""


. display "Final dataset verification:"
Final dataset verification:

. display "- Total observations: " _N
- Total observations: 2045735

. display "- Unique person IDs: " 
- Unique person IDs: 

. quietly duplicates report unique_person_id

. display r(unique_N)
.

. 
. // Save as Stata data file with unique identifier preserved
. save "output/acs_with_imputed_wfh.dta", replace
file output/acs_with_imputed_wfh.dta saved

. 
. // Also save as CSV for broader compatibility
. export delimited "output/acs_with_imputed_wfh.csv", replace
file output/acs_with_imputed_wfh.csv saved

. 
. display ""


. display "Final dataset saved successfully!"
Final dataset saved successfully!

. display "Stata file: output/acs_with_imputed_wfh.dta"
Stata file: output/acs_with_imputed_wfh.dta

. display "CSV file: output/acs_with_imputed_wfh.csv"
CSV file: output/acs_with_imputed_wfh.csv

. display "Both files contain unique_person_id for merging back to original ACS data"
Both files contain unique_person_id for merging back to original ACS data

. 
. /*
> ==============================================================================
> PHASE 4: VALIDATION AND SANITY CHECKS
> ==============================================================================
> */
. 
. display ""


. display "PHASE 4: VALIDATION AND SANITY CHECKS"
PHASE 4: VALIDATION AND SANITY CHECKS

. display "{hline 50}"
--------------------------------------------------

. 
. /*
> PHASE 4.1: SUMMARIZE THE PREDICTIONS
> */
. 
. display ""


. display "4.1 PREDICTION SUMMARY:"
4.1 PREDICTION SUMMARY:

. display "{hline 30}"
------------------------------

. 
. summarize alpha, detail

           Predicted WFH Share (Imputed from SWAA)
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0999197       .0634432
 5%      .122755       .0634432
10%     .1504515        .063576       Obs           2,045,735
25%     .2125273        .063576       Sum of wgt.   2,045,735

50%     .2828304                      Mean            .306402
                        Largest       Std. dev.      .1282871
75%     .3926187       .7055226
90%     .5097285       .7071269       Variance       .0164576
95%      .542354       .7071269       Skewness       .5112537
99%     .5915445       .7073576       Kurtosis        2.36827

. 
. // Check for valid range
. local min_alpha = r(min)

. local max_alpha = r(max)

. local mean_alpha = r(mean)

. local median_alpha = r(p50)

. 
. display ""


. display "Validation Checks:"
Validation Checks:

. display "- Minimum value: " %6.4f `min_alpha' " (should be >= 0)"
- Minimum value: 0.0634 (should be >= 0)

. display "- Maximum value: " %6.4f `max_alpha' " (should be <= 1)"
- Maximum value: 0.7074 (should be <= 1)

. display "- Mean value: " %6.4f `mean_alpha'
- Mean value: 0.3064

. display "- Median value: " %6.4f `median_alpha'
- Median value: 0.2828

. 
. if `min_alpha' < 0 {
.     display "WARNING: Predictions below 0 detected!"
. }

. if `max_alpha' > 1 {
.     display "WARNING: Predictions above 1 detected!"
. }

. 
. /*
> PHASE 4.2: COMPARE GROUP AVERAGES
> */
. 
. display ""


. display "4.2 GROUP AVERAGES COMPARISON:"
4.2 GROUP AVERAGES COMPARISON:

. display "{hline 45}"
---------------------------------------------

. 
. // Calculate average alpha by occupation category
. capture {

. 
. // Calculate average alpha by industry
. capture {

. 
. // Calculate average alpha by education
. capture {

. 
. // Calculate average alpha by gender
. capture {

. 
. /*
> PHASE 4.3: SPOT-CHECK INDIVIDUAL PREDICTIONS
> */
. 
. display ""


. display "4.3 SPOT-CHECK INDIVIDUAL PREDICTIONS:"
4.3 SPOT-CHECK INDIVIDUAL PREDICTIONS:

. display "{hline 40}"
----------------------------------------

. 
. // Display some high and low predictions for manual inspection
. display ""


. display "Highest WFH Share Predictions (Top 10):"
Highest WFH Share Predictions (Top 10):

. gsort -alpha

. list occupation_clean work_industry education_s gender alpha in 1/10, clean

       occupa~n   work_i~y   educat~s   gender      alpha  
  1.          9          2          4        1   .7073576  
  2.          9          2          5        1   .7071269  
  3.          9          2          5        1   .7071269  
  4.          9          2          5        1   .7055226  
  5.          9          2          5        2    .702266  
  6.          9          2          5        1   .7020537  
  7.          9          2          5        1   .7004334  
  8.          9          2          4        1   .6985307  
  9.          9          2          4        1   .6985307  
 10.          9          2          4        1   .6985307  

. 
. display ""


. display "Lowest WFH Share Predictions (Bottom 10):"
Lowest WFH Share Predictions (Bottom 10):

. gsort alpha

. list occupation_clean work_industry education_s gender alpha in 1/10, clean

       occupa~n   work_i~y   educat~s   gender      alpha  
  1.         11          7          2        2   .0634432  
  2.         11          7          2        2   .0634432  
  3.         11          7          2        2    .063576  
  4.         11          7          2        2    .063576  
  5.         11          7          2        1   .0648692  
  6.         11          7          2        2   .0664351  
  7.         11          7          2        2   .0668638  
  8.         11          7          2        2   .0668638  
  9.         11          7          2        2   .0668638  
 10.         11          7          2        2   .0680372  

. 
. /*
> FINAL SUMMARY
> */
. 
. display ""


. display "{hline 80}"
--------------------------------------------------------------------------------

. display "WFH IMPUTATION COMPLETE"
WFH IMPUTATION COMPLETE

. display "{hline 80}"
--------------------------------------------------------------------------------

. display ""


. display "Summary:"
Summary:

. display "- Model estimated on SWAA data"
- Model estimated on SWAA data

. display "- Predictions generated for ACS data (preprocessed via Polars)"
- Predictions generated for ACS data (preprocessed via Polars)

. display "- Final dataset: output/acs_with_imputed_wfh.dta"
- Final dataset: output/acs_with_imputed_wfh.dta

. display "- Sample size: " _N
- Sample size: 2045735

. display "- Mean WFH share: " %6.4f `mean_alpha'
- Mean WFH share: 0.3064

. display "- Unique identifier preserved for merging: unique_person_id"
- Unique identifier preserved for merging: unique_person_id

. display ""


. display "Files created:"
Files created:

. display "- output/wfh_model_estimates.ster (model estimates)"
- output/wfh_model_estimates.ster (model estimates)

. display "- output/acs_with_imputed_wfh.dta (main output with unique_person_id)"
- output/acs_with_imputed_wfh.dta (main output with unique_person_id)

. display "- output/acs_with_imputed_wfh.csv (CSV version with unique_person_id)"
- output/acs_with_imputed_wfh.csv (CSV version with unique_person_id)

. display "- output/wfh_imputation_log.log (this log)"
- output/wfh_imputation_log.log (this log)

. display ""


. display "NOTE: Use unique_person_id to merge imputed WFH shares back to original ACS data"
NOTE: Use unique_person_id to merge imputed WFH shares back to original ACS data

. display "ACS preprocessing documented in doc/acs_processing_polar.md"
ACS preprocessing documented in doc/acs_processing_polar.md

. 
. // Close log
. capture log close
